        >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. PT1.
AUTHOR. John Stephen Johnson.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
        SELECT PT1FILE ASSIGN TO "COB1-EMPLOYEE.dat"
        ORGANIZATION IS LINE SEQUENTIAL
        ACCESS IS SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD PT1FILE.
01 PEmployeeAttributes.
        02 PEMPNUM PIC X(7).
        02 PEMPLNAME PIC X(12).
        02 PEMPFNAME PIC X(13).
        02 PEMPTYPE PIC X(6).
        02 PEMPTITLE PIC X(17).
        02 PSPACES PIC X(5).
        02 PEMPSSNF3 PIC X(3).
        02 PEMPSSNN3 PIC X(3).
        02 PEMPSSNL3 PIC X(3).
        02 PDOTS PIC X(24).
        02 PMON PIC X(2).
        02 PDAY PIC X(2).
        02 PYEAR PIC X(4).

01 PLINECOUNT PIC 9(2).
01 PLINECALC PIC 9(2).      
01 PEVEN PIC 9(2) VALUE 2.
01 PREM PIC 9(2).

WORKING-STORAGE SECTION.
01 SEmployeeA.
        02 SEMPNUM PIC X(7).
        02 SEMPLNAME PIC X(12).
        02 SEMPFNAME PIC X(13).
        02 SEMPTYPE PIC X(6).
        02 SEMPTITLE PIC X(17).
        02 SSPACES PIC X(5).
        02 SEMPSSNF3 PIC X(3).
        02 SEMPSSNN3 PIC X(3).
        02 SEMPSSNL3 PIC X(3).
        02 SDOTS PIC X(24).
        02 SMON PIC X(2).
        02 SDAY PIC X(2).
        02 SYEAR PIC X(4).
01 SLINECOUNT PIC 9(2).
01 SLINECALC PIC 9(2).
01 SEVEN PIC 9(2) VALUE 2.
01 SREM PIC 9(2).
01 DELIM PIC X(30).

01 FileEnd PIC A(1).

PROCEDURE DIVISION.

DISPLAY "SSN" SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES 
SPACES SPACES SPACES SPACES "EMP ID" SPACES SPACES SPACES SPACES"LAST"
SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES 
SPACES SPACES SPACES SPACES SPACES"FIRST"SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES
SPACES SPACES SPACES SPACES SPACES"TITLE"SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES
SPACES SPACES SPACES SPACES SPACES SPACES SPACES"TYPE"
SPACES SPACES SPACES SPACES SPACES"DATE"
DISPLAY SPACES 
OPEN INPUT PT1FILE.        
        PERFORM UNTIL FileEnd='Y'
            READ PT1FILE INTO SEmployeeA 
                AT END MOVE 'Y' TO FileEnd
                NOT AT END COMPUTE SLINECOUNT = SLINECOUNT + 1
                DIVIDE SEVEN INTO SLINECOUNT GIVING SLINECALC REMAINDER SREM
                IF SREM = 0 THEN
                DISPLAY SEMPSSNF3 "-" SEMPSSNN3 "-" SEMPSSNL3 WITH NO ADVANCING
                    STRING SEMPLNAME
                        DELIMITED BY SPACE INTO DELIM
                    MOVE DELIM TO SEMPLNAME
                    MOVE 0 TO DELIM
                DISPLAY SPACES SPACES SPACES SPACES SPACES SPACES SEMPNUM
                SPACES SPACES SPACES SEMPLNAME SPACES SPACES SEMPFNAME
                SPACES SPACES SPACES SPACES SPACES SPACES SPACES SPACES
                SPACES SPACES SPACES SEMPTITLE SPACES SPACES
                SEMPTYPE SPACES SPACES SPACES SPACES SPACES SMON "/" SDAY "/" SYEAR
           END-READ
        END-PERFORM

CLOSE PT1FILE.
        
STOP RUN.
